#Область ПрограммныйИнтерфейс

// Дополняет Форму документа реквизитом контактное лицо
// Параметр: 
//   Форма - ФормаКлиентскогоПриложения.
//
Процедура ДополнениеФормы(Форма)Экспорт 
	 
	 ИмяФормы = Форма.ИмяФормы;
	 
	 Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" 
	 ИЛИ ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента"
	 ИЛИ ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		 
		 ДобавитьРеквизитКонтактноеЛицоНаФорму(Форма);
		 
	 ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		 
		 СледующийЭлемент = Форма.Элементы.Основание;
		 ВставитьРеквизитКонтактноеЛицоНаФормуПередЭлементом(Форма,СледующийЭлемент);
		 
	 ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		 
		 СледующийЭлемент = Форма.Элементы.СуммаДокумента;
		 ВставитьРеквизитКонтактноеЛицоНаФормуПередЭлементом(Форма,СледующийЭлемент);
		 
	 КонецЕсли; 
	 
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьРеквизитКонтактноеЛицоНаФорму(Форма);
	
	НовыйЭлемент = Форма.Элементы.Добавить("КонтактноеЛицо",Тип("ПолеФормы"),Форма.Элементы.ГруппаШапкаПраво);
	НовыйЭлемент.ПутьКДанным = "Объект.ДК_КонтактноеЛицо";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Контактное лицо";
		 	 
КонецПроцедуры

Процедура ВставитьРеквизитКонтактноеЛицоНаФормуПередЭлементом(Форма,Элемент);
	
	НовыйЭлемент = Форма.Элементы.Вставить("КонтактноеЛицо",Тип("ПолеФормы"),,Элемент);
	НовыйЭлемент.ПутьКДанным = "Объект.ДК_КонтактноеЛицо";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Контактное лицо";
	
КонецПроцедуры 

#КонецОбласти